Music_App/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "1234@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password) #F
        user = User.find_by(email: email)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token #G
        loop do
            session_token = SecureRandom::urlsafe_base64(16)
            return session_token unless User.exists?(session_token: session_token)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-21 21:51:15.184279"], ["id", 2]]
---
    def reset_session_token! #R
        self.session_token = generate_unique_session_token
        self.save!